SunCity/src/Documents/ТабельУчетаРабочегоВремени/ТабельУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчетаРабочегоВремени</name>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеОВремени</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Часов1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов6</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов7</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов8</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов9</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов11</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов12</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов13</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов14</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов15</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов16</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов17</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов19</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов20</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов21</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов22</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов23</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов24</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов25</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов26</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов27</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов28</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов29</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов30</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часов31</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени1</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени2</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени3</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени4</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени5</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени6</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени7</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени8</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени9</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени10</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени11</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени12</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени13</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени14</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени15</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени16</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени17</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени18</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени19</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени20</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени21</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени22</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени23</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени24</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени25</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени26</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени27</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени28</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени29</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени30</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидВремени31</name>
      <type>
        <types>EnumRef.ВидыИспользованияРабочегоВремени</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SunCity/src/Documents/ТабельУчетаРабочегоВремени/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	МассивНепроверяемыхРеквизитов.Добавить("ДанныеОВремени.Сотрудник");
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	СписокНеЗаполненныхСтрок = Новый СписокЗначений;
	
	КоличествоСтрок = ЭтотОбъект.ДанныеОВремени.Количество();
	

	Для Каждого СтрокаДанныеОВремени Из ЭтотОбъект.ДанныеОВремени Цикл
		Если Не ЗначениеЗаполнено(СтрокаДанныеОВремени.Сотрудник) И (СтрокаДанныеОВремени.НомерСтроки % 2) = 0 Тогда
			СписокНеЗаполненныхСтрок.Добавить(СтрокаДанныеОВремени.НомерСтроки / 2);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого НомерСтроки Из СписокНеЗаполненныхСтрок Цикл
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не заполнено поле Сотрудник в строке %1'"), НомерСтроки);
		Поле = НСтр("ru = 'ДанныеОВремени.Сотрудник'");
		ОбщегоНазначения.СообщитьПользователю(Текст, ЭтотОбъект, Поле,,	Отказ);
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
		ИнициализироватьДокумент();
КонецПроцедуры

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Ответственный = Пользователи.ТекущийПользователь();
	Магазин = ЗначениеНастроекПовтИсп.МагазинПоУмолчанию(Магазин);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
